blueprints/infosat/sap/request_xml/sap_invoices_supplier_read_by_id.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:glob="http://sap.com/xi/SAPGlobal20/Global">
   <soapenv:Header/>
   <soapenv:Body>
      <glob:Z_SuppInvoiceReadByIDQuery_sync>
         <Z_SuppInvoice>
            <facturaID>{{invoiceID}}</facturaID>
         </Z_SuppInvoice>
      </glob:Z_SuppInvoiceReadByIDQuery_sync>
   </soapenv:Body>
</soapenv:Envelope>